console.log("Завдання: 5 ==============================");

// Створюємо функцію task5, яка буде використовувати проміси.
function task5() {
  // Створюємо змінну counter яка буде лічильником та присвоюємо значення 0
  let counter = 0;

  // Створюємо проміс з іменем intervalPromise
  const intervalPromise = new Promise((resolve, reject) => {
    // Використовуємо функцію setInterval, щоб імітувати асинхронну операцію, яка повторюється кожну секунду
    const intervalId = setInterval(() => {
      counter++; // Збільшуємо лічильник на 1
      console.log(`Значення лічильника: ${counter}`);

      if (counter === 5) {
        clearInterval(intervalId); // Коли лічильник досягає 5, зупиняємо інтервал
        resolve(counter); // Викликаємо resolve, який повертає значення лічильника
      }
    }, 1000);
  });

  // Використовуємо .then метод для отримання значення, яке було передане у функцію resolve() в нашому промісі, та виводимо його в консоль.
  intervalPromise
    .then((result) => {
      console.log(`Значення лічильника досягло: ${result}`);
    })
    .catch((error) => {
      console.error("Помилка:", error);
    })
    .finally(() => {
      console.log("Завершення лічильника");
      // Тут можна розмістити код, який виконається незалежно від того, в якому стані завершився проміс
    });
}
// Викликаємо функцію task5
task5();
